#Provided by AI SOCIETY.
##Trainer- Sameer Nigam

# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [6]:
import numpy as np
import pandas as pd

** Read Salaries.csv as a dataframe called sal.**

In [7]:
datafr = pd.read_csv("Salaries.csv")

<ipython-input-7-cc97aa20ca81>:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  datafr = pd.read_csv("Salaries.csv")

** Check the head of the DataFrame. **

In [8]:
datafr.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [6]:
datafr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 10.2+ MB

**What is the average BasePay ?**

In [36]:
numeric_val = pd.to_numeric(datafr['BasePay'],errors='coerce')
numeric_val.mean()

66325.4488404877

** What is the highest amount of OvertimePay in the dataset ? **

In [37]:
max_val = pd.to_numeric(datafr['OvertimePay'],errors='coerce')
max_val.max()

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [9]:
emp_name = "JOSEPH DRISCOLL"
datafr.loc[datafr["EmployeeName"] == emp_name, "JobTitle"]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [15]:
datafr.loc[datafr["EmployeeName"] == emp_name, "TotalPayBenefits"]

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?

In [25]:
highest_val = datafr["TotalPayBenefits"].idxmax()
pd.DataFrame(datafr.loc[highest_val]).transpose()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [26]:
lowest_val = datafr["TotalPayBenefits"].idxmin()
pd.DataFrame(datafr.loc[lowest_val]).transpose()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [37]:
numeric_val = pd.to_numeric(datafr['BasePay'],errors='coerce')
datafr["NumericBasePay"] = numeric_val.dropna()
datafr.groupby("Year")["NumericBasePay"].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: NumericBasePay, dtype: float64

** How many unique job titles are there? **

In [38]:
datafr["JobTitle"].nunique()

2159

** What are the top 5 most common jobs? **

In [42]:
datafr["JobTitle"].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [55]:
# data_2013 = datafr[datafr["Year"] == 2013]
job_count = datafr[datafr["Year"] == 2013]["JobTitle"].value_counts()
one_person_job = job_count[job_count == 1]
len(one_person_job)

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [29]:
def find_string(str):
    if 'chief' in str.lower().split():
        return True
    else:
        return False

In [30]:
sum(datafr['JobTitle'].apply(lambda x: find_string(x)))

477

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [31]:
datafr['title_len'] = datafr['JobTitle'].apply(len)

In [34]:
datafr[['title_len', 'TotalPayBenefits']].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!